1=1. \uC790\uBC14 \uD504\uB85C\uADF8\uB798\uBC0D \uC5B8\uC5B4\uC758 \uD2B9\uC9D5\uC744 \uC633\uAC8C \uC124\uBA85\uD55C \uAC83\uC73C\uB85C \uC9DD\uC9C0\uC6CC\uC9C4 \uAC83\uC744 \uACE0\uB974\uC2DC\uC624.\n(\u3131) '\uC790\uBC14 \uD50C\uB7AB\uD3FC'\uC774\uB77C\uB294 \uBCC4\uB3C4\uC758 \uC2E4\uD589 \uD658\uACBD\uC744 \uAC00\uC9C4\uB2E4.\n(\u3134) \uC644\uC804\uD55C \uAC1D\uCCB4\uC9C0\uD5A5 \uC5B8\uC5B4\uB77C\uAE30\uBCF4\uB2E4\uB294 \uC808\uCC28\uC801 \uC5B8\uC5B4\uC640 \uAC1D\uCCB4 \uC9C0\uD5A5\uC5B8\uC5B4\uC758 \uC131\uACA9\uC744 \uBAA8\uB450 \uAC00\uC9C0\uB294 \uD63C\uD569\uD615 \uC5B8\uC5B4\uC774\uB2E4.\n(\u3137) \uBB38\uBC95\uC801\uC73C\uB85C C/C++ \uC5B8\uC5B4\uC640 \uC720\uC0AC\uD558\uB098 \uC790\uB8CC\uD615\uC5D0 \uB300\uD55C \uAC80\uC0AC\uAC00 \uC5C4\uACA9\uD558\uC9C0 \uC54A\uC544 \uCEF4\uD30C\uC77C \uC624\uB958\uC758 \uC18C\uC9C0\uB97C \uB9CE\uC774 \uC904\uC600\uB2E4.\n(\u3139) \uC608\uC678 \uCC98\uB9AC \uAE30\uB2A5\uACFC \uBA40\uD2F0 \uC2A4\uB808\uB529\uC744 \uC9C0\uC6D0\uD55C\uB2E4.\n \n\u2460 \u3131, \u3134\n\u2461 \u3131, \u3137, \u3139\n\u2462 \u3131, \u3139\n\u2463 \u3137, \u3139\n \n
2=2. \uC790\uBC14 \uC18C\uC2A4 \uD30C\uC77C\uC744 \uCEF4\uD30C\uC77C\uD558\uBA74 \uD655\uC7A5\uC790\uAC00 '.class'\uC778 \uBAA9\uC801 \uD30C\uC77C\uC774 \uC0DD\uC131\uB41C\uB2E4. \uC774\uAC83\uC740 \uD50C\uB7AB\uD3FC\uC5D0 \uB3C5\uB9BD\uC801\uC774\uBA70 \uC6B4\uC601\uCCB4\uC81C\uC640 \uC0C1\uAD00\uC5C6\uC774 \uC2E4\uD589\uAC00\uB2A5\uD55C\uB370, \uAE30\uACC4\uC5B4\uC640 \uBE44\uAD50\uD558\uC5EC \uBB34\uC5C7\uC774\uB77C \uBD80\uB974\uB294\uAC00?\n\u2460 \uC560\uD50C\uB9BF\n\u2461 \uBC14\uC774\uD2B8\uCF54\uB4DC\n\u2462 \uC560\uD50C\uB9AC\uCF00\uC774\uC158\n\u2463 \uC790\uBC14 API\n \n
3=3. \uB2E4\uC74C \uC911 \uC790\uBC14\uC5D0\uC11C \uC81C\uACF5\uD558\uB294 \uAE30\uBCF8 \uC790\uB8CC\uD615\uC774 \uC544\uB2CC \uAC83\uC740?\n\u2460 char\n\u2461 short\n\u2462 string\n\u2463 boolean\n \n
4=4. \uB2E4\uC74C \uC911 \uCEF4\uD30C\uC77C\uD560 \uB54C \uBB38\uC81C\uAC00 \uC5C6\uB294 \uAC83\uC740?\n\u2460 char c = 'cafe';\n\u2461 char d = 'cafe';\n\u2462 char e = '\ucafe';\n\u2463 char f = '\u10100';\n \n \n \n
5=5. 'C:?>java TestJava 123' \uAC19\uC740 \uBA85\uB839\uD589\uC73C\uB85C \uC544\uB798 \uD504\uB85C\uADF8\uB7A8\uC744 \uC2E4\uD589\uD558\uC600\uC744 \uB54C \uCD9C\uB825\uB418\uB294 \uACB0\uACFC\uB294 \uBB34\uC5C7\uC778\uAC00?\n \npublic class TestJava {\n        public static void main(String args[]){\n                 System.out.println(args[1]) ;\n        }\n}\n \n\u2460 java\n\u2461 TestJava\n\u2462 123\n\u2463 \uC608\uC678(Exception)\uAC00 \uBC1C\uC0DD\uD55C\uB2E4.\n \n
6=6. \uB2E4\uC74C \uD504\uB85C\uADF8\uB7A8\uC740 \uCEF4\uD30C\uC77C\uB418\uC9C0 \uC54A\uB294\uB2E4. \uC5B4\uB290 \uB77C\uC778\uC5D0 \uC624\uB958\uAC00 \uC788\uB294\uAC00?\n \nclass Test {\n        int x = 1; // 2\uBC88 \uB77C\uC778\n        static int y; //3\uBC88 \uB77C\uC778\n        public static void main(String[] args) {\n                 System.out.println(x); // 5\uBC88 \uB77C\uC778\n                 System.out.println(y); // 6\uBC88 \uB77C\uC778\n        }\n}\n \n\u2460 2\uBC88 \uB77C\uC778\n\u2461 3\uBC88 \uB77C\uC778\n\u2462 5\uBC88 \uB77C\uC778\n\u2463 6\uBC88 \uB77C\uC778\n \n
7=7. \uC544\uB798 \uD504\uB85C\uADF8\uB7A8\uC744 \uCEF4\uD30C\uC77C\uD55C \uD6C4 \uC2E4\uD589\uD558\uBA74 \uC608\uC678\uAC00 \uBC1C\uC0DD\uD55C\uB2E4. \uC5B4\uB290 \uB77C\uC778\uC5D0 \uBB38\uC81C\uAC00 \uC788\uB294\uAC00?\n \npublic class Test {\n        public static void main(String[] x){ // 2\uBC88 \uB77C\uC778\n        int d[][] = new int[2][]; // 3\uBC88 \uB77C\uC778\n        d[0] = new int[2]; // 4\uBC88 \uB77C\uC778\n        System.out.println(d[1].length); // 5\uBC88 \uB77C\uC778\n        }\n}\n\u2460 2\uBC88 \uB77C\uC778\n\u2461 3\uBC88 \uB77C\uC778\n\u2462 4\uBC88 \uB77C\uC778\n\u2463 5\uBC88 \uB77C\uC778\n \n
8=8. \uB2E4\uC74C \uD504\uB85C\uADF8\uB7A8\uC744 \uCEF4\uD30C\uC77C\uD558\uC5EC \uCD9C\uB825\uD560 \uB54C, \uACB0\uACFC\uB294 \uBB34\uC5C7\uC778\uAC00?\n \nclass Test {\n        public static void main(String args[]) {\n                 int[][] intAry = {{0, 1, 2}, {3, 4, 5, 6}};\n                 System.out.println(intAry.length + intAry[0].length + intAry[1].length);\n        }\n}\n\u2460 9\n\u2461 234\n\u2462 6\n\u2463 123\n \n
9=9. \uD30C\uC77C \uC774\uB984\uC774 "A.java"\uC778 \uB2E4\uC74C \uD504\uB85C\uADF8\uB7A8\uC744 \uCEF4\uD30C\uC77C \uD558\uC600\uC744 \uB54C\uC758 \uACB0\uACFC\uB97C \uC633\uAC8C \uC124\uBA85\uD55C \uAC83\uC740?\n \npublic class A {\n        public int a;\n        int b;\n        protected int c;\n        private int d;\n}\nclass B extends A {\n        B( ) {\n                 a = 0;\n                 b = 1;\n                 c = 2;\n                 d = 3;\n        }\n}\n \n\u2460 \uD30C\uC77C \uC774\uB984\uC774 \uC798\uBABB\uB418\uC5C8\uC73C\uBBC0\uB85C \uCEF4\uD30C\uC77C\uB418\uC9C0 \uC54A\uB294\uB2E4.\n\u2461 \uD074\uB798\uC2A4 A\uC5D0 \uAE30\uBCF8 \uC0DD\uC131\uC790\uAC00 \uC5C6\uC73C\uBBC0\uB85C \uCEF4\uD30C\uC77C\uB418\uC9C0 \uC54A\uB294\uB2E4.\n\u2462 \uC811\uADFC \uBC94\uC704\uB97C \uBC97\uC5B4\uB09C \uBCC0\uC218 \uC0AC\uC6A9\uC774 \uC788\uC73C\uBBC0\uB85C \uCEF4\uD30C\uC77C\uB418\uC9C0 \uC54A\uB294\uB2E4.\n\u2463 \uCEF4\uD30C\uC77C \uC624\uB958\uAC00 \uC5C6\uB2E4.\n \n
10=\u203B \uB2E4\uC74C \uD504\uB85C\uADF8\uB7A8\uC744 \uBCF4\uACE0 \uBB3C\uC74C\uC5D0 \uB2F5\uD558\uB77C. (10\uFF5E11)\nclass Person {\n        String name;\n        public static void main(String[] args) {\n                 Person m = new Person(); // 4\uBC88 \uB77C\uC778\n                 m.go();\n        }\n        public void Person(String name) {\n                 // 8\uBC88 \uB77C\uC778\n        }\n        void go() {\n                 System.out.println(name);\n        }\n}\n \n10. 4\uBC88 \uB77C\uC778\uC740 Person \uD074\uB798\uC2A4\uC758 \uAE30\uBCF8 \uC0DD\uC131\uC790\uB97C \uD544\uC694\uB85C \uD558\uB098 Person \uD074\uB798\uC2A4\uC5D0\uB294 \uAE30\uBCF8 \uC0DD\uC131\uC790\uAC00 \uBA85\uC2DC\uB418\uC5B4\uC788\uC9C0 \uC54A\uB2E4. \uC704 \uD504\uB85C\uADF8\uB7A8\uC744 \uCEF4\uD30C\uC77C\uD560 \uB54C, \uACB0\uACFC\uB97C \uAC00\uC7A5 \uC798 \uC124\uBA85\uD55C \uAC83\uC740?\n \n\u2460 \uD504\uB85C\uADF8\uB798\uBA38\uAC00 \uD56D\uC0C1 \uAE30\uBCF8 \uC0DD\uC131\uC790\uB97C \uBA85\uC2DC\uD574\uC57C \uD55C\uB2E4. \uB530\uB77C\uC11C \uCEF4\uD30C\uC77C \uC624\uB958\uAC00 \uB09C\uB2E4.\n\u2461 \uD074\uB798\uC2A4\uC5D0 \uC5B4\uB5A0\uD55C \uC0DD\uC131\uC790 \uC120\uC5B8\uB3C4 \uC5C6\uC73C\uBBC0\uB85C \uAE30\uBCF8 \uC0DD\uC131\uC790\uB294 \uC790\uB3D9\uC73C\uB85C \uB9CC\uB4E4\uC5B4\uC9C4\uB2E4. \uB530\uB77C\uC11C \uCEF4\uD30C\uC77C\uC740 \uC131\uACF5\uC801\uC73C\uB85C \uC218\uD589\uB41C\uB2E4.\n\u2462 \uD074\uB798\uC2A4\uC5D0 \uB2E4\uB978 \uC0DD\uC131\uC790\uAC00 \uC788\uC73C\uBBC0\uB85C \uAE30\uBCF8 \uC0DD\uC131\uC790\uB294 \uC790\uB3D9\uC73C\uB85C \uB9CC\uB4E4\uC5B4\uC9C0\uC9C0 \uC54A\uB294\uB2E4. \uB530\uB77C\uC11C \uCEF4\uD30C\uC77C \uC624\uB958\uAC00 \uB09C\uB2E4.\n\u2463 \uAE30\uBCF8 \uC0DD\uC131\uC790\uB294 \uD56D\uC0C1 \uC790\uB3D9\uC73C\uB85C \uB9CC\uB4E4\uC5B4\uC9C0\uBBC0\uB85C \uCEF4\uD30C\uC77C\uC740 \uC131\uACF5\uC801\uC73C\uB85C \uC218\uD589\uB41C\uB2E4.\n \n
11=\u203B \uB2E4\uC74C \uD504\uB85C\uADF8\uB7A8\uC744 \uBCF4\uACE0 \uBB3C\uC74C\uC5D0 \uB2F5\uD558\uB77C. (10\uFF5E11)\nclass Person {\n        String name;\n        public static void main(String[] args) {\n                 Person m = new Person(); // 4\uBC88 \uB77C\uC778\n                 m.go();\n        }\n        public void Person(String name) {\n                 // 8\uBC88 \uB77C\uC778\n        }\n        void go() {\n                 System.out.println(name);\n        }\n}\n11. \uBC11\uC904 \uADF8\uC740 8\uBC88 \uB77C\uC778\uC5D0 \uAC00\uC7A5 \uC801\uB2F9\uD55C \uBB38\uC7A5\uC740 \uBB34\uC5C7\uC778\uAC00? name \uD544\uB4DC\uC758 \uAC12\uC5D0 \uC778\uC790\uB85C \uBC1B\uC740 name\uC758 \uAC12\uC744 \uC9C0\uC815\uD55C\uB2E4.\n\u2460 name = name; \n\u2461 this.name = name;\n\u2462 name = this.name;\n\u2463 this.name = this.name;\n \n
12=\u203B \uB2E4\uC74C \uD504\uB85C\uADF8\uB7A8\uC744 \uBCF4\uACE0 \uBB3C\uC74C\uC5D0 \uB2F5\uD558\uB77C. (12\uFF5E13)\nclass Super {\n        String s = 'Super';\n        public void printVal() {\n                 System.out.println('Super');\n        }\n}\nclass Sub Super {\n        String s = 'Sub';\n        public void printVal() {\n                 System.out.println('Sub'); \n        }\n}\n \npublic class Runner {\n        public static void main(String[] args) {\n                 Super sup = new Sub();\n                 System.out.print(sup.s + ' '); \n                 sup.printVal(); \n        }\n}\n12. \uD074\uB798\uC2A4 Sub\uB294 \uD074\uB798\uC2A4 Super\uB97C \uC0C1\uC18D\uD558\uB294 \uD074\uB798\uC2A4\uC774\uB2E4. \uBC11\uC904 \uCE5C \uBD80\uBD84\uC5D0 \uC801\uB2F9\uD55C \uD0A4\uC6CC\uB4DC\uB294 \uBB34\uC5C7\uC778\uAC00?\n\u2460 implement\n\u2461 implements\n\u2462 extends\n\u2463 extend\n \n
13=\u203B \uB2E4\uC74C \uD504\uB85C\uADF8\uB7A8\uC744 \uBCF4\uACE0 \uBB3C\uC74C\uC5D0 \uB2F5\uD558\uB77C. (12\uFF5E13)\nclass Super {\n        String s = 'Super';\n        public void printVal() {\n                 System.out.println('Super');\n        }\n}\nclass Sub Super {\n        String s = 'Sub';\n        public void printVal() {\n                 System.out.println('Sub'); \n        }\n}\n \npublic class Runner {\n        public static void main(String[] args) {\n                 Super sup = new Sub();\n                 System.out.print(sup.s + ' '); \n                 sup.printVal(); \n        }\n} \n13. \uC704 \uD504\uB85C\uADF8\uB7A8\uC758 \uC2E4\uD589 \uACB0\uACFC\uB294 \uBB34\uC5C7\uC778\uAC00?\n\u2460 Super Sub\n\u2461 Super Super\n\u2462 Sub Super\n\u2463 Sub Sub\n \n
14=\u203B \uB2E4\uC74C \uD504\uB85C\uADF8\uB7A8\uC744 \uBCF4\uACE0 \uBB3C\uC74C\uC5D0 \uB2F5\uD558\uB77C. (14\uFF5E15)\n \ninterface Movable {\n        void add(double dx, double dy);\n        void sub(double dx, double dy);\n}\ninterface MovableScalable \u2460 Movable {\n        void mul(double s);\n}\nclass MovablePoint \u2461 Movable {\n        double x, y;\n        \u2462 \n}\n \n14. \uBC11\uC904 \uCE5C \u2460\uACFC \u2461\uC5D0 \uB4E4\uC5B4\uAC08 \uD0A4\uC6CC\uB4DC\uB97C \uC21C\uC11C\uB300\uB85C \uB098\uC5F4\uD558\uBA74 \uBB34\uC5C7\uC778\uAC00?\n\u2460 implements implements\n\u2461 extends extends\n\u2462 implements extends\n\u2463 extends implements\n
15=\u203B \uB2E4\uC74C \uD504\uB85C\uADF8\uB7A8\uC744 \uBCF4\uACE0 \uBB3C\uC74C\uC5D0 \uB2F5\uD558\uB77C. (14\uFF5E15)\n \ninterface Movable {\n        void add(double dx, double dy);\n        void sub(double dx, double dy);\n}\ninterface MovableScalable \u2460 Movable {\n        void mul(double s);\n}\nclass MovablePoint \u2461 Movable {\n        double x, y;\n        \u2462 \n}\n15. \uBC11\uC904 \uADF8\uC740 \u2462\uC5D0 \uB4E4\uC5B4\uAC00\uC57C \uD560 \uB0B4\uC6A9\uC73C\uB85C, \uB2E4\uC74C \uC911 \uAC00\uC7A5 \uC801\uB2F9\uD55C \uAC83\uC740 \uBB34\uC5C7\uC778\uAC00?\n\u2460      void add(double dx, double dy) { }\n        void sub(double dx, double dy) { }\n\u2461      public void add(double dx, double dy) { }\n        public void sub(double dx, double dy) { }\n\u2462      abstract void add(double dx, double dy);\n        abstract void sub(double dx, double dy);\n\u2463      public static void add(double dx, double dy) { }\n        public static sub(double dx, double dy) { }\n
16=16. \uB2E4\uC74C \uD504\uB85C\uADF8\uB7A8\uC744 \uCEF4\uD30C\uC77C\uD560 \uB54C \uBA87 \uAC1C\uC758 \uD074\uB798\uC2A4 \uD30C\uC77C\uC774 \uC0DD\uC131\uB418\uB294\uAC00?\n \ninterface AnonymClass {\n        public void normalFunc();\n}\npublic class Test {\n        public static void main(String args[]) {\n                 AnonymClass anonym_class = new AnonymClass() {\n                         public void normalFunc() {\n                                  System.out.println(`Implemented normalFunc()`);\n                         }\n                 };\n                 anonym_class.normalFunc();\n        }\n}\n\u2460 1\uAC1C\n\u2461 2\uAC1C\n\u2462 3\uAC1C\n\u2463 4\uAC1C\n \n
17=17. \uD0A4\uC6CC\uB4DC final\uC5D0 \uAD00\uD55C \uC124\uBA85 \uC911 \uC798\uBABB\uB41C \uAC83\uC740?\n\u2460 final \uD074\uB798\uC2A4\uB294 \uC0C1\uC18D\uB420 \uC218 \uC5C6\uB2E4.\n\u2461 \uD074\uB798\uC2A4 \uC548\uC5D0 \uC120\uC5B8\uB41C final \uD544\uB4DC\uC5D0 \uCD08\uAE30 \uAC12\uC744 \uC900 \uD6C4\uC5D0\uB294 \uC774 \uD544\uB4DC\uC758 \uAC12\uC744 \uBCC0\uACBD\uD560 \uC218 \uC5C6\uB2E4.\n\u2462 \uBA54\uC18C\uB4DC \uC548\uC5D0 \uC120\uC5B8\uB41C final \uBCC0\uC218\uB294 \uBA54\uC18C\uB4DC \uC2E4\uD589\uC744 \uB3D9\uAE30\uD654\uD558\uAE30 \uC704\uD574 \uC0AC\uC6A9\uB41C\uB2E4.\n\u2463 \uD074\uB798\uC2A4 \uC548\uC5D0 \uC120\uC5B8\uB41C final \uBA54\uC18C\uB4DC\uB294 \uC11C\uBE0C \uD074\uB798\uC2A4\uC5D0\uC11C \uC7AC\uC815\uC758\uB420 \uC218 \uC5C6\uB2E4.\n \n
18=18. \uC544\uB798 \uBCF4\uAE30\uC5D0 \uB098\uC624\uB294 \uB0B4\uC6A9\uC73C\uB85C \uC790\uBC14 \uD504\uB85C\uADF8\uB7A8\uC744 \uB9CC\uB4E4 \uB54C, \uC791\uC131 \uC21C\uC11C\uB97C \uC633\uAC8C \uC124\uBA85\uD55C \uAC83\uC740?\n \n(\u3131) class Test { }\n(\u3134) package kim.java;\n(\u3137) import java.io.*;\n \n\u2460 (\u3131), (\u3134), (\u3137)\n\u2461 (\u3134), (\u3137), (\u3131)\n\u2462 (\u3137), (\u3134), (\u3131)\n\u2463 \uC5B4\uB5A4 \uC21C\uC11C\uB85C \uB193\uC774\uB4E0 \uC0C1\uAD00\uC5C6\uB2E4.\n \n
19=19. \uB2E4\uC74C \uD504\uB85C\uADF8\uB7A8\uC5D0\uC11C MyException\uC740 \uC0AC\uC6A9\uC790 \uC815\uC758\uC608\uC678\uC774\uB2E4. \uBC11\uC904 \uBD80\uBD84\uC5D0 \uC54C\uB9DE\uC740 \uD0A4\uC6CC\uB4DC\uB97C \uC21C\uC11C\uB300\uB85C \uB098\uC5F4\uD558\uBA74 \uBB34\uC5C7\uC778\uAC00?\n \nclass MyExceptionTest {\n        public void testFunc(int x) MyException {\n                 if (x > 10) new MyException();\n        }\n}\n \n\u2460 throw throw\n\u2461 throws throw\n\u2462 throw throws\n\u2463 throws throws\n \n
20=20. Object \uD074\uB798\uC2A4\uC5D0\uC11C \uC815\uC758\uB41C \uAC83\uC73C\uB85C, \uC544\uB798 \uD504\uB85C\uADF8\uB7A8\uC5D0\uC11C 5\uBC88 \uB77C\uC778\uC758 \uC2E4\uD589\uACFC \uAD00\uB828 \uC788\uB294 \uBA54\uC18C\uB4DC\uB294 \uBB34\uC5C7\uC778\uAC00?\n \nclass A extends Object { }\npublic class Test {\n        public static void main(String args[]) {\n                 A a = new A();\n                 System.out.println(a); // 5\uBC88 \uB77C\uC778\n        }\n}\n \n\u2460 toString()\n\u2461 equals()\n\u2462 finalize()\n\u2463 clone()\n \n
21=21. \uB2E4\uC74C\uC774 \uC124\uBA85\uD558\uACE0 \uC788\uB294 \uD074\uB798\uC2A4\uB294 \uBB34\uC5C7\uC778\uAC00?\n \n\uB0B4\uBD80\uC801\uC73C\uB85C \uBC84\uD37C\uB77C \uBD88\uB9AC\uB294 \uACF5\uAC04\uC744 \uAC00\uC9C0\uACE0 \uC788\uACE0 \uADF8 \uACF3\uC5D0 \uBB38\uC790\uC5F4 \uB370\uC774\uD130\uB97C \uC800\uC7A5\uD55C\uB2E4. \uADF8\uB9AC\uACE0 \uADF8 \uBC84\uD37C\uB294 \uB9C8\uCE58 \uBB38\uC790\uD615 \uBC30\uC5F4\uCC98\uB7FC \uB2E4\uB8E8\uC5B4\uC9C0\uAE30 \uB54C\uBB38\uC5D0 \uB0B4\uC6A9\uC758 \uBCC0\uACBD\uC774 \uAC00\uB2A5\uD558\uBA70 insert( )\uB098 append( )\uC640 \uAC19\uC740 \uBA54\uC18C\uB4DC\uB97C \uC81C\uACF5\uD55C\uB2E4.\n \n\u2460 String\n\u2461 StringBuffer\n\u2462 StringReader\n\u2463 StringTokenizer\n \n
22=22. String \uD074\uB798\uC2A4\uC758 \uAC1D\uCCB4\uAC00 \uC77C\uB2E8 \uC0DD\uC131\uB41C \uD6C4\uC5D0\uB294, \uADF8 \uAC1D\uCCB4\uC758 \uBB38\uC790\uC5F4\uC744 \uBC14\uAFC0 \uC218 \uC5C6\uB2E4. \uB2E4\uC74C \uD504\uB85C\uADF8\uB7A8\uC758 \uC2E4\uD589\uACB0\uACFC\uB294 \uBB34\uC5C7\uC778\uAC00?\n \npublic class Example {\n        public static void main(String args[]) {\n                 String s1 = new String('Java');\n                 String s2 = s1.replace('a', 'o');\n                 s1.concat('Program');\n                 System.out.println(s1 + ' ' + (s1 + s2).charAt(5));\n        }\n}\n \n\u2460 JavaProgram r\n\u2461 JavaProgram P\n\u2462 Java o \n\u2463 Java a\n \n
23=23. \uB2E4\uC74C \uD504\uB85C\uADF8\uB7A8\uC758 \uC2E4\uD589 \uACB0\uACFC\uB294 \uBB34\uC5C7\uC778\uAC00?\n \npublic class Example {\n        public static void main(String args[]) {\n                 String s1 = 'Java';\n                 String s2 = 'Java';\n                 String s3 = new String('Java');\n                 System.out.print(s1==s2);\n                 System.out.print(s1==s3);\n                 System.out.println(s1.equals(s3));\n        }\n}\n \n\u2460 truetruetrue\n\u2461 truefalsefalse\n\u2462 falsefalsetrue\n\u2463 truefalsetrue\n \n
24=24. \uC790\uBC14\uC5D0\uC11C\uB294 \uAE30\uBCF8 \uC790\uB8CC\uD615\uC758 \uAC12\uC744 \uAC1D\uCCB4\uB85C \uB2E4\uB8E8\uAE30 \uC704\uD55C \uD074\uB798\uC2A4\uB97C \uC81C\uACF5\uD558\uACE0 \uC788\uB2E4. \uC774\uB7EC\uD55C \uD074\uB798\uC2A4\uB97C \uD1B5\uCE6D\uD558\uC5EC \uBB34\uC5C7\uC774\uB77C \uD558\uB294\uAC00?\n\u2460 Object \uD074\uB798\uC2A4\n\u2461 Reflection \uD074\uB798\uC2A4\n\u2462 Integer \uD074\uB798\uC2A4\n\u2463 Wrapper \uD074\uB798\uC2A4\n \n
25=25. \uB2E4\uC74C \uD504\uB85C\uADF8\uB7A8\uC758 \uBC11\uC904 \uBD80\uBD84\uC5D0 \uB4E4\uC5B4\uAC00\uC57C \uD558\uB294 \uAC83\uC73C\uB85C \uC801\uB2F9\uD55C \uAC83\uC740?\n \nclass A implements ____________ {\n        public void run() { }\n}\npublic class Test {\n        public static void main(String args[]) {\n                 Thread a = new Thread(new A());\n                 a.start();\n        }\n}\n \n\u2460 Thread\n\u2461 Runnable\n\u2462 RunHandler\n\u2463 Serializable\n \n \n \n \n
26=26. \uC2A4\uB808\uB4DC \uB3D9\uAE30\uD654\uC640 \uAD00\uB828\uB41C \uB2E4\uC74C \uC124\uBA85 \uC911 \uC62C\uBC14\uB978 \uAC83\uC740?\n\u2460 \uC2A4\uB808\uB4DC \uB3D9\uAE30\uD654\uB780 \uC5EC\uB7EC \uC2A4\uB808\uB4DC\uB4E4\uC774 \uD558\uB098\uC758 \uACF5\uC720 \uAC1D\uCCB4\uC5D0 \uB3D9\uC2DC \uC811\uADFC\uD558\uAC8C \uD558\uAE30 \uC704\uD55C \uAC83\uC774\uB2E4.\n\u2461 \uBA54\uC18C\uB4DC notify()\uB294 \uD604\uC7AC \uC2E4\uD589\uC911\uC778 \uC2A4\uB808\uB4DC\uB97C \uC815\uD574\uC9C4 \uC2DC\uAC04 \uB3D9\uC548 \uC911\uC9C0\uC2DC\uD0A8\uB2E4.\n\u2462 \uBA54\uC18C\uB4DC wait()\uB294 \uB300\uAE30 \uC0C1\uD0DC\uC758 \uC2A4\uB808\uB4DC\uB4E4 \uAC00\uC6B4\uB370 \uD558\uB098\uB97C \uAE30\uB2E4\uB9AC\uAC8C \uD55C\uB2E4.\n\u2463 synchronized\uB85C \uC815\uC758\uB41C \uBA54\uC18C\uB4DC\uB294 \uD55C \uBC88\uC5D0 \uD558\uB098\uC758 \uC2A4\uB808\uB4DC\uC5D0 \uC758\uD574\uC11C\uB9CC \uC2E4\uD589\uB420 \uC218 \uC788\uB2E4.\n \n
27=27. \uCC98\uB9AC \uC2A4\uD2B8\uB9BC\uC740 \uB370\uC774\uD130\uC758 \uD2B9\uBCC4\uD55C \uCC98\uB9AC \uAE30\uB2A5\uC744 \uC81C\uACF5\uD558\uB294 \uC2A4\uD2B8\uB9BC\uC73C\uB85C \uBC18\uB4DC\uC2DC \uB370\uC774\uD130 \uC2F1\uD06C\uC2A4\uD2B8\uB9BC\uACFC \uD568\uAED8 \uC0AC\uC6A9\uB418\uC5B4\uC57C \uD55C\uB2E4. \uB2E4\uC74C \uC911 \uCC98\uB9AC \uC2A4\uD2B8\uB9BC\uC5D0 \uD574\uB2F9\uD558\uB294 \uD074\uB798\uC2A4\uB294 \uBB34\uC5C7\uC778\uAC00?\n\u2460 CharArrayReader\n\u2461 FileReader\n\u2462 StringReader\n\u2463 BufferedReader\n \n
28=28. \uAC1D\uCCB4 \uC9C1\uB82C\uD654\uB97C \uC704\uD55C \uD074\uB798\uC2A4\uB97C \uC815\uC758\uD560 \uB54C \uAD6C\uD604\uD574\uC57C \uD558\uB294 \uC778\uD130\uD398\uC774\uC2A4\uB294 \uBB34\uC5C7\uC778\uAC00? (3\uC810)\n\u2460 Serializable\n\u2461 Reflection\n\u2462 ServantLocator\n\u2463 Series\n \n
29=29. \uC6D0\uC18C\uB4E4\uC758 \uC911\uBCF5\uC744 \uD5C8\uC6A9\uD558\uC9C0 \uC54A\uACE0, \uC6D0\uC18C\uB4E4 \uAC04\uC758 \uC21C\uC11C\uC5D0 \uC758\uBBF8\uAC00 \uC5C6\uC73C\uBA70, \uC815\uB82C\uB418\uC5B4 \uC788\uC9C0 \uC54A\uC740 \uC6D0\uC18C\uB4E4\uC758 \uCEEC\uB809\uC158\uC744 \uC704\uD55C \uAE30\uB2A5\uC744 \uC815\uC758\uD558\uACE0 \uC788\uB294 \uC778\uD130\uD398\uC774\uC2A4\uB294 \uBB34\uC5C7\uC778\uAC00?\n\u2460 List\n\u2461 Set\n\u2462 Queue\n\u2463 SortedMap\n \n
30=30. \uB2E4\uC591\uD55C \uAC1D\uCCB4\uB4E4\uC744 \uC800\uC7A5\uD560 \uC218 \uC788\uC73C\uBA70, \uAC01 \uC6D0\uC18C\uB97C \uC815\uC218 \uCCA8\uC790\uB85C \uCC38\uC870\uD560 \uC218 \uC788\uC73C\uBBC0\uB85C \uBC30\uC5F4\uACFC \uC720\uC0AC\uD55C \uD074\uB798\uC2A4\uC774\uB098 \uD06C\uAE30\uAC00 \uC790\uB3D9 \uC870\uC808\uB418\uBBC0\uB85C \uC77C\uBC18\uC801\uC778 \uBC30\uC5F4\uBCF4\uB2E4 \uC0AC\uC6A9\uD558\uAE30 \uD3B8\uB9AC\uD55C \uD074\uB798\uC2A4\uB294 \uBB34\uC5C7\uC778\uAC00?\n\u2460 Arrays\n\u2461 Vector\n\u2462 HashSet\n\u2463 Enumeration\n \n \n \n
31=31. \uB2E4\uC74C \uD504\uB85C\uADF8\uB7A8\uC5D0\uC11C MyException\uC740 \uC0AC\uC6A9\uC790 \uC815\uC758 \uC608\uC678\uC774\uB2E4. \uB610\uD55C \uC608\uC678\uAC00 \uBC1C\uC0DD\uD55C \uACF3\uC5D0\uC11C \uC608\uC678 \uCC98\uB9AC\uB97C \uD558\uC9C0 \uC54A\uACE0 \uC608\uC678\uB97C \uD638\uCD9C\uD55C \uACF3\uC73C\uB85C \uC804\uD30C\uD558\uACE0 \uC788\uB2E4. \uBC11\uC904 \uCE5C (1)\uACFC (2)\uC5D0 \uC54C\uB9DE\uC740 \uD0A4\uC6CC\uB4DC\uB97C \uC21C\uC11C\uB300\uB85C \uB098\uC5F4\uD558\uBA74 \uBB34\uC5C7\uC778\uAC00?\n \nclass MyExceptionTest {\n        public void testFunc(int x) (1) MyException {\n                 if (x > 10) (2) new MyException( );\n        }\n}\n\u2460 throw, throw\n\u2461 throws, throw\n\u2462 throw, throws\n\u2463 throws, throws\n \n
32=32. \uD504\uB808\uC784(Frame)\uC758 \uAE30\uBCF8 \uBC30\uCE58 \uAD00\uB9AC\uC790\uB85C, \uCEE8\uD14C\uC774\uB108 \uCEF4\uD3EC\uB10C\uD2B8\uAC00 \uC790\uC2DD \uCEF4\uD3EC\uB10C\uD2B8\uB4E4\uC744 \uB3D9, \uC11C, \uB0A8, \uBD81, \uC911\uC559\uC5D0 \uC704\uCE58\uC2DC\uD0A4\uACE0\uC790 \uD560 \uB54C \uC0AC\uC6A9\uD558\uB294 \uBC30\uCE58 \uAD00\uB9AC\uC790\uB294 \uBB34\uC5C7\uC778\uAC00?\n \n\u2460 BorderLayout\n\u2461 FlowLayout\n\u2462 GridLayout\n\u2463 CardLayout\n \n
33=33. \uB2E4\uC74C \uBCF4\uAE30\uB294 \uC911\uB7C9 \uCEF4\uD3EC\uB10C\uD2B8\uC640 \uACBD\uB7C9 \uCEF4\uD3EC\uB10C\uD2B8\uC5D0 \uB300\uD55C \uC124\uBA85\uC774\uB2E4. \uC633\uAC8C \uC124\uBA85\uD55C \uAC83\uC744 \uBAA8\uB450 \uACE0\uB974\uC2DC\uC624.\n(\u3131) \uACBD\uB7C9 \uCEF4\uD3EC\uB10C\uD2B8\uB97C \uB9CC\uB4E4\uAE30 \uC704\uD574\uC11C Component \uD074\uB798\uC2A4\uB97C \uC9C1\uC811 \uC0C1\uC18D\uD558\uB294 \uD074\uB798\uC2A4\uB97C \uB9CC\uB4E0\uB2E4.\n(\u3134) AWT\uC758 Button \uCEF4\uD3EC\uB10C\uD2B8\uB294 \uC911\uB7C9 \uCEF4\uD3EC\uB10C\uD2B8\uC774\uB2E4.\n(\u3137) \uACBD\uB7C9 \uCEF4\uD3EC\uB10C\uD2B8\uB294 \uC6B4\uC601\uCCB4\uC81C\uC5D0 \uB530\uB77C \uADF8 \uBAA8\uC591\uACFC \uAE30\uBCF8 \uB3D9\uC791\uC774 \uB2E4\uB974\uB2E4.\n(\u3139) \uC911\uB7C9 \uCEF4\uD3EC\uB10C\uD2B8\uB294 \uC6B4\uC601\uCCB4\uC81C, \uD50C\uB7AB\uD3FC\uACFC \uC0C1\uAD00\uC5C6\uC774 \uC790\uBC14\uB85C \uC9C1\uC811 \uCC98\uB9AC\uB418\uB294 \uCEF4\uD3EC\uB10C\uD2B8\uC774\uB2E4.\n\u2460 \u3131, \u3134\n\u2461 \u3131, \u3134, \u3139\n\u2462 \u3134, \u3137, \u3139\n\u2463 \u3137, \u3139\n \n
34=34. \uB2E4\uC74C AWT\uC758 GUI \uCEF4\uD3EC\uB10C\uD2B8\uB4E4 \uC911\uC5D0\uC11C \uCEE8\uD14C\uC774\uB108\uC5D0 \uD574\uB2F9\uB418\uC9C0 \uC54A\uB294 \uAC83\uC740?\n\u2460 Canvas\n\u2461 Window\n\u2462 Frame\n\u2463 Panel\n \n
35=35. \uC544\uB798 \uBCF4\uAE30\uB294 \uCEF4\uD3EC\uB10C\uD2B8\uC758 \uC0C9\uCE60\uD558\uAE30\uC640 \uAD00\uB828 \uC788\uB294 \uBA54\uC18C\uB4DC\uB4E4\uC5D0 \uAD00\uD55C \uC77C\uBC18\uC801\uC778 \uC124\uBA85\uC774\uB2E4. \uC798\uBABB\uB41C \uAC83\uC740 \uBB34\uC5C7\uC778\uAC00?\n\u2460 paint() - \uC0C9\uCE60\uC774 \uD544\uC694\uD560 \uB54C \uC790\uB3D9 \uD638\uCD9C\uB418\uB294 \uCF5C\uBC31 \uBA54\uC18C\uB4DC\uC774\uB2E4.\n\u2461 repaint() - Component \uD074\uB798\uC2A4\uC758 repaint() \uBA54\uC18C\uB4DC\uB97C \uBC18\uB4DC\uC2DC \uC7AC\uC815\uC758\uD558\uC5EC \uC0AC\uC6A9\uD574\uC57C \uD55C\uB2E4.\n\u2462 update() - \uD544\uC694\uD55C \uBD80\uBD84\uB9CC\uC744 \uB2E4\uC2DC \uADF8\uB9AC\uBA74 \uD6A8\uACFC\uC801\uC778 \uACBD\uC6B0\uC5D0 \uC7AC\uC815\uC758\uD558\uC5EC \uC0AC\uC6A9\uD55C\uB2E4. \n\u2463 paint()\uC640 update() \uBA54\uC18C\uB4DC\uAC00 \uAC00\uC9C0\uB294 \uB9E4\uAC1C \uBCC0\uC218 \uC720\uD615\uC740 Graphics\uC774\uB2E4.\n \n
36=36. \uB2E4\uC74C \uCEF4\uD3EC\uB10C\uD2B8\uB4E4 \uC911\uC5D0\uC11C ActionEvent\uAC00 \uBC1C\uC0DD\uB420 \uC218 \uC5C6\uB294 \uAC83\uC740 \uBB34\uC5C7\uC778\uAC00?\n\u2460 Button\n\u2461 MenuItem\n\u2462 Frame\n\u2463 List\n \n
37=37. 2\uAC1C \uC774\uC0C1\uC758 \uC774\uBCA4\uD2B8 \uCC98\uB9AC \uBA54\uC18C\uB4DC\uB97C \uD3EC\uD568\uD558\uB294 \uB9AC\uC2A4\uB108 \uC778\uD130\uD398\uC774\uC2A4\uB97C \uAD6C\uD604\uD558\uAE30 \uC704\uD574\uC11C\uB294 \uBAA8\uB4E0 \uBA54\uC18C\uB4DC\uB97C \uAD6C\uD604\uD574\uC57C\uD558\uB294 \uBD88\uD3B8\uC774 \uB530\uB978\uB2E4. \uB2E4\uC74C \uD074\uB798\uC2A4\uB294 WindowListener \uC778\uD130\uD398\uC774\uC2A4\uB97C \uAD6C\uD604\uD558\uB294 \uD074\uB798\uC2A4\uC778\uB370, \uBD88\uD544\uC694\uD55C \uBA54\uC18C\uB4DC\uC758 \uAD6C\uD604\uC744 \uC0DD\uB7B5\uD558\uAE30 \uC704\uD55C \uBC29\uBC95\uC73C\uB85C \uB2E4\uC74C\uC5D0 \uBC11\uC904 \uCE5C \uBD80\uBD84\uC744 \uB300\uC2E0\uD560 \uC218 \uC788\uB294 \uAC83\uC740 \uBB34\uC5C7\uC778\uAC00?\n \nclass MyListener implements WindowListener {\n        ... ...\n} \n \n\u2460 implements AddWindowListener\n\u2461 extends AddWindowListener\n\u2462 implements WindowAdapter\n\u2463 extends WindowAdapter\n \n
38=38. \uADF8\uB798\uD53D \uC774\uBBF8\uC9C0\uB97C \uB2E4\uB8E8\uB294 \uAC83\uC5D0 \uAD00\uD55C \uB2E4\uC74C \uC124\uBA85 \uC911 \uC798\uBABB\uB41C \uAC83\uC740?\n\u2460 Image \uD074\uB798\uC2A4\uB294 \uCD94\uC0C1 \uD074\uB798\uC2A4\uC774\uBBC0\uB85C \uCEF4\uD3EC\uB10C\uD2B8\uC758 \uACBD\uC6B0 \uBA54\uC18C\uB4DC createImage()\uB97C \uC774\uC6A9\uD558\uC5EC \uC624\uD504-\uC2A4\uD06C\uB9B0 \uC774\uBBF8\uC9C0 \uAC1D\uCCB4\uB97C \uC0DD\uC131\uD55C\uB2E4.\n\u2461 \uBCF5\uC7A1\uD55C \uC774\uBBF8\uC9C0\uB97C \uD654\uBA74\uC5D0 \uADF8\uB824\uC57C \uD560 \uACBD\uC6B0 \uC624\uD504-\uC2A4\uD06C\uB9B0 \uC774\uBBF8\uC9C0\uB97C \uC0AC\uC6A9\uD558\uBA74 \uC911\uAC04 \uACFC\uC815\uC744 \uBCF4\uC5EC\uC8FC\uC9C0 \uC54A\uACE0 \uCD5C\uC885 \uACB0\uACFC\uB9CC \uD654\uBA74\uC5D0 \uB098\uD0C0\uB098\uAC8C \uD560 \uC218 \uC788\uB2E4.\n\u2462 \uC624\uD504-\uC2A4\uD06C\uB9B0 \uC774\uBBF8\uC9C0\uB97C \uBA3C\uC800 \uB9CC\uB4E0 \uD6C4, \uB098\uC911\uC5D0 \uD654\uBA74\uC5D0 \uBCF4\uC5EC\uC8FC\uB294 \uAE30\uBC95\uC744 \uB354\uBE14 \uD074\uB9AC\uD551\uC774\uB77C\uACE0 \uD55C\uB2E4.\n\u2463 \uC874\uC7AC\uD558\uB294 \uC774\uBBF8\uC9C0 \uD30C\uC77C\uC744 \uAC00\uC9C0\uACE0 Image \uAC1D\uCCB4\uB97C \uC0DD\uC131\uD558\uB294 \uACBD\uC6B0\uC5D0\uB294 \uADF8\uB798\uD53D \uCEE8\uD14D\uC2A4\uD2B8\uB97C \uC5BB\uAE30 \uC704\uD574 getGraphics() \uBA54\uC18C\uB4DC\uB97C \uC0AC\uC6A9\uD560 \uC218 \uC5C6\uB2E4.\n \n
39=39. \uB2E4\uC74C\uC774 \uC124\uBA85\uD558\uACE0 \uC788\uB294 \uAC83\uC5D0 \uD574\uB2F9\uD558\uB294 \uD074\uB798\uC2A4\uB294 \uBB34\uC5C7\uC778\uAC00? \n \n- \uC774\uBBF8\uC9C0 \uD30C\uC77C\uC744 \uBD88\uB7EC\uB4E4\uC77C \uB54C \uC0DD\uAE30\uB294 \uB3D9\uAE30\uD654 \uBB38\uC81C\uB97C \uD574\uACB0\uD558\uAE30 \uC704\uD574 \uC0AC\uC6A9\uD55C\uB2E4.\n- \uC774\uBBF8\uC9C0\uC640 \uAC19\uC740 \uBBF8\uB514\uC5B4 \uAC1D\uCCB4\uC758 \uC0C1\uD0DC\uB97C \uCD94\uC801\uD558\uB294 \uAE30\uB2A5\uC744 \uAC00\uC9C0\uACE0 \uC788\uB2E4.\n- \uAC1D\uCCB4\uC5D0 \uC774\uBBF8\uC9C0\uB97C \uCD94\uAC00\uD558\uAE30 \uC704\uD574\uC11C addImage() \uBA54\uC18C\uB4DC\uB97C \uC0AC\uC6A9\uD55C\uB2E4.\n- \uCD94\uC801\uD558\uB294 \uBAA8\uB4E0 \uC774\uBBF8\uC9C0\uAC00 \uB85C\uB4DC\uB420 \uB54C\uAE4C\uC9C0 \uAE30\uB2E4\uB9AC\uAE30 \uC704\uD574\uC11C waitForAll()\uC744 \uC0AC\uC6A9\uD55C\uB2E4.\n \n\u2460 Image\n\u2461 ImageFilter\n\u2462 MediaTracker\n\u2463 MediaTray\n \n
40=40. \uC560\uD50C\uB9BF \uD504\uB85C\uADF8\uB7A8(\uB610\uB294 \uD074\uB798\uC2A4)\uC5D0 \uAD00\uD55C \uB2E4\uC74C \uC124\uBA85 \uC911 \uC798\uBABB\uB41C \uAC83\uC740?\n\u2460 \uC560\uD50C\uB9BF \uD504\uB85C\uADF8\uB7A8\uC744 \uB9CC\uB4E4\uAE30 \uC704\uD574 Applet \uD074\uB798\uC2A4\uB97C \uC0C1\uC18D\uD558\uB294 \uD074\uB798\uC2A4\uAC00 \uD544\uC694\uD558\uB2E4.\n\u2461 Applet \uD074\uB798\uC2A4\uB294 Panel\uC744 \uC0C1\uC18D\uD558\uBBC0\uB85C \uAE30\uBCF8 \uBC30\uCE58 \uAD00\uB9AC\uC790\uB294 FlowLayout\uC774\uB2E4.\n\u2462 \uC560\uD50C\uB9AC\uCF00\uC774\uC158\uACFC \uB9C8\uCC2C\uAC00\uC9C0\uB85C main() \uD568\uC218\uAC00 \uC788\uC5B4\uC57C \uD558\uB098 \uC778\uD130\uD504\uB9AC\uD130\uB85C \uC2E4\uD589\uC2DC\uD0AC \uC218 \uC5C6\uB2E4.\n\u2463 \uD074\uB798\uC2A4\uB97C \uC815\uC758\uD560 \uB54C init(), start() \uBC0F stop() \uBA54\uC18C\uB4DC\uB97C \uBC18\uB4DC\uC2DC \uC7AC\uC815\uC758\uD574\uC57C \uD558\uB294 \uAC83\uC740 \uC544\uB2C8\uB2E4.\n
41=\uBB38\uC81C:\uC720\uAD50\uC758 \uB3C4\uB355\uC801 \uC0AC\uC0C1\uC5D0\uC11C \uAE30\uBCF8\uC774 \uB418\uB294 3\uAC00\uC9C0\uC758 \uAC15\uB839\uACFC 5\uAC00\uC9C0\uC758 \uC778\uB95C\uC744 \uBB34\uC5C7\uC774\uB77C \uD560\uAE4C\uC694? [3\uAC00\uC9C0\uC758 \uB3C4\uB9AC / 5\uAC00\uC9C0\uC758 \uB355\uBAA9]\n
42=\uBB38\uC81C : \uADF8\uB9AC\uC2A4 \uC2E0\uD654\uC5D0\uC11C \uB098\uC624\uB294 \uD2F0\uD0C4\uC871 \uC774\uC544\uD398\uD1A0\uC2A4\uC758 \uC544\uB4E4\uC774\uBA70, '\uBA3C\uC800 \uC0DD\uAC01\uD558\uB294 \uC0AC\uB78C'\uC774\uB77C\uB294 \uB73B\uC758 \uC774\uB984\uC778 \uC774 \uC778\uBB3C\uC740?\n
43=\uBB38\uC81C : \uAD6D\uAC00\uAD8C\uB825\uC758 \uC791\uC6A9\uC744 \uC785\uBC95  \uD589\uC815  \uC0AC\uBC95\uC758 \uC14B\uC73C\uB85C \uB098\uB204\uC5B4, \uAD6D\uAC00\uC758 \uB0A8\uC6A9\uC744 \uBC29\uC9C0\uD558\uB294 \uD1B5\uCE58\uC870\uC9C1\uC6D0\uB9AC\uC778 \uC774\uAC83\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
44=\uBB38\uC81C : 18\uC138\uAE30 \uC911\uC5FD \uC601\uAD6D\uC5D0\uC11C \uC2DC\uC791\uB41C \uAE30\uC220\uD601\uC2E0\uACFC \uC774\uC5D0 \uC218\uBC18\uD558\uC5EC \uC77C\uC5B4\uB09C \uC0AC\uD68C  \uACBD\uC81C \uAD6C\uC870\uC758 \uBCC0\uD601\uC744 \uBB34\uC5C7\uC774\uB77C \uD560\uAE4C\uC694?\n
45=\uBB38\uC81C : \uBBF8\uAD6D \uCE98\uB9AC\uD3EC\uB2C8\uC544\uC8FC \uB0A8\uC11C\uBD80 \uC560\uB108\uD558\uC784\uC5D0 \uC704\uCE58\uD574 \uC788\uB294 \uC138\uACC4\uC801\uC778 \uC720\uC6D0\uC9C0\uC774\uC790, \uB300\uADDC\uBAA8\uC758 \uC624\uB77D\uC2DC\uC124\uC778 \uC774\uACF3\uC740 \uC5B4\uB514\uC77C\uAE4C\uC694?\n
46=\uBB38\uC81C : 1627\uB144(\uC778\uC870 \uB54C) \uB9CC\uC8FC\uC5D0 \uBCF8\uAC70\uB97C \uB454 \uD6C4\uAE08\uC758 \uCE68\uC785\uC73C\uB85C \uC77C\uC5B4\uB09C \uC870\uC120\uACFC \uD6C4\uAE08 \uC0AC\uC774\uC758 \uC804\uC7C1\uC778 \uC774\uAC83\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
47=\uBB38\uC81C : \uD55C \uC785 \uD06C\uAE30\uB85C \uB9CC\uB4E0 \uC911\uAD6D\uC758 \uB9CC\uB450\uB85C 3,000\uB144 \uC804 \uBD80\uD130 \uC911\uAD6D \uB0A8\uBD80 \uAD11\uB465(\uAD11\uB3D9)\uC9C0\uBC29\uC5D0\uC11C \uB9CC\uB4E4\uC5B4 \uBA39\uAE30 \uC2DC\uC791\uD55C \uC774\uAC83\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
48=\uBB38\uC81C : \uC11C\uC6B8\uD2B9\uBCC4\uC2DC \uAD11\uC9C4\uAD6C \uC790\uC591\uB3D9\uACFC \uC1A1\uD30C\uAD6C \uC2E0\uCC9C\uB3D9\uC744 \uC787\uB294 \uD55C\uAC15\uC758 \uB2E4\uB9AC\uC774\uBA70, 1972\uB144 7\uC6D4\uC5D0 \uC900\uACF5 \uD558\uC600\uC2B5\uB2C8\uB2E4 \uC774\uACF3\uC740 \uC5B4\uB514\uC77C\uAE4C\uC694?\n
49=\uBB38\uC81C : \uB1CC\uC758 \uC2E0\uACBD\uC138\uD3EC \uC190\uC0C1\uC73C\uB85C \uC190\uACFC \uD314\uC5D0 \uACBD\uB828\uC774 \uC77C\uC5B4\uB098\uACE0, \uBCF4\uD589\uC774 \uC5B4\uB824\uC6CC\uC9C0\uB294 \uC190\uC0C1\uC744 \uC785\uB294 \uC774 \uC9C8\uBCD1\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
50=\uBB38\uC81C : \uD0C0\uC778\uC758 \uAE30\uB300\uB098 \uAD00\uC2EC\uC73C\uB85C \uC778\uD558\uC5EC \uB2A5\uB960\uC774 \uC624\uB974\uAC70\uB098 \uACB0\uACFC\uAC00 \uC88B\uC544\uC9C0\uB294 \uD604\uC0C1\uC778 \uC774 \uD6A8\uACFC\uB294 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
51=\uBB38\uC81C : \uD749\uCE21\uD55C \uC5BC\uAD74\uC744 \uAC00\uBA74\uC73C\uB85C \uAC00\uB9B0 \uAD34\uC2E0\uC0AC\uAC00 \uC544\uB984\uB2E4\uC6B4 \uD504\uB9AC\uB9C8\uB3C8\uB098\uB97C \uC9DD\uC0AC\uB791\uD558\uB294 \uB0B4\uC6A9\uC774 \uB2F4\uAE34 \uC774 \uBBA4\uC9C0\uCEEC\uC758 \uC774\uB984\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
52=\uBB38\uC81C : \uACBD\uAE30\uB3C4 \uC548\uC0B0  \uC2DC\uD765  \uD654\uC131\uC2DC\uC5D0 \uAC78\uCCD0 \uC788\uB294 \uC778\uACF5\uD638\uC218\uB85C, \uC2DC\uD654\uBC29\uC870\uC81C\uB97C \uC644\uACF5\uD558\uBA74\uC11C \uC870\uC131\uB41C \uC774 \uC778\uACF5\uD638\uC218\uC758 \uC774\uB984\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
53=\uBB38\uC81C : \uD55C\uAD6D \uCCAD\uB3D9\uAE30 \uC2DC\uB300\uC758 \uB300\uD45C\uC801\uC778 \uBB34\uB364 \uC591\uC2DD\uC73C\uB85C, \uC9C0\uC11D\uBB18\uB77C\uACE0\uB3C4 \uBD88\uB9AC\uB294 \uC774\uAC83\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
54=\uBB38\uC81C : \uC774\uC2A4\uB77C\uC5D8\uC758 \uC885\uAD50\uC801 \uC9C0\uB3C4\uC790\uC774\uC790 \uBBFC\uC871\uC801 \uC601\uC6C5\uC73C\uB85C, \uC774\uC9D1\uD2B8 \uD30C\uB77C\uC624\uC640 \uC2F8\uC6CC \uC774\uACA8\uC11C \uBBFC\uC871 \uD574\uBC29\uC744 \uC774\uB8E9\uD55C \uC774 \uC778\uBB3C\uC740 \uB204\uAD6C\uC77C\uAE4C\uC694?\n
55=\uBB38\uC81C : \uC77C\uBCF8\uC758 \uC6D0\uB85C \uC815\uCE58\uAC00\uC774\uC790 \uCD1D\uB9AC\uC774\uBA70 \uBA54\uC774\uC9C0 \uD5CC\uBC95\uC758 \uCD08\uC548\uC744 \uB9C8\uB828\uD558\uC600\uACE0, \uC548\uC911\uADFC \uC758\uC0AC\uC5D0\uAC8C \uC800\uACA9\uB2F9\uD558\uC5EC \uC0AC\uB9DD\uD55C \uC774 \uC778\uBB3C\uC740 \uB204\uAD6C\uC77C\uAE4C\uC694?\n
56=\uBB38\uC81C : \uC0AC\uB78C\uC758 \uBAB8\uBB34\uAC8C\uAC00 \uAC00\uC7A5 \uB9CE\uC774 \uB098\uAC08 \uB54C\uB294 \uC5B8\uC81C\uC77C\uAE4C\uC694?(\uB10C\uC13C\uC2A4)\n
57=\uBB38\uC81C : \uC911\uC138 \uB9D0\uAE30\uC5D0 \uC601\uAD6D\uACFC \uD504\uB791\uC2A4\uAC00 \uBC8C\uC778 \uC804\uC7C1\uC778 '\uBC31\uB144 \uC804\uC7C1'\uC740 \uBA87 \uB144\uAC04 \uCE58\uB904\uC9C4 \uC804\uC7C1\uC77C\uAE4C\uC694?\n
58=\uBB38\uC81C : \uB178\uBCA8\uC0C1 \uBD84\uC57C\uB294 \uCD1D 6\uAC1C\uB85C - \uC0DD\uB9AC\uC758\uD559\uC0C1, \uBB3C\uB9AC\uD559\uC0C1, \uD654\uD559\uC0C1, \uBB38\uD559\uC0C1, \uACBD\uC81C\uD559\uC0C1, \uADF8\uB9AC\uACE0 \uB098\uBA38\uC9C0 \u25CB\u25CB\u25CB\uC774 \uC788\uC2B5\uB2C8\uB2E4 \uC774\uAC83\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
59=\uBB38\uC81C : \uB300\uD55C\uBBFC\uAD6D\uC5D0\uC11C \uBA74\uC801\uC774 \uAC00\uC7A5 \uD070 \uC9C0\uC5ED\uC740 \uC5B4\uB514\uC77C\uAE4C\uC694?\n
60=\uBB38\uC81C : \uBC94\uC8C4\uC790\uC5D0\uAC8C \uB2E8\uAE30\uC758 \uC790\uC720\uD615\uC744 \uC120\uACE0\uD560 \uB54C \uADF8 \uC815\uC0C1\uC744 \uCC38\uC791\uD558\uC5EC \uC77C\uC815\uAE30\uAC04 \uB3D9\uC548 \uADF8 \uD615\uC744 \uC720\uC608\uD558\uB294 \uC81C\uB3C4\uC778 \uC774 \uC81C\uB3C4\uB294 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n \n
61=\uBB38\uC81C : \uC6A9\uC561\uC758 \uC0B0\uC131, \uC5FC\uAE30\uC131\uC744 \uD310\uB2E8\uD558\uB294\uB370 \uC4F0\uC774\uB294 '\uC885\uC774\uC758 \uC774\uB984'\uC73C\uB85C \uC0B0\uC131\uC740 \uBD89\uC740\uC0C9, \uC5FC\uAE30\uC131\uC740 \uD478\uB978\uC0C9\uC744 \uB760\uC6B4\uB2E4 \uC774 \uC885\uC774\uC758 \uC774\uB984\uC740?\n
62=\uBB38\uC81C : \uC6B8\uB989\uB3C4\uC758 \uC61B \uC774\uB984\uC740 '\uC6B0\uC0B0\uAD6D'\uC785\uB2C8\uB2E4 \uADF8\uB807\uB2E4\uBA74 '\uC81C\uC8FC\uB3C4'\uC758 \uC61B \uC774\uB984\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
63=\uBB38\uC81C : \uC61B \uC870\uC120\uC2DC\uB300\uC5D0\uC11C '\uC5BC\uC74C'\uC744 \uAD00\uB9AC\uD558\uB358 \uAD00\uC544(\uBD80\uC11C)\uC758 \uC774\uB984\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
64=\uBB38\uC81C : \uC0C8 \uC815\uBD80\uAC00 \uCD9C\uBC94\uD560 \uB54C \uC815\uCC45\uC758 \uBD88\uD655\uC2E4\uC131\uC774 \uC18C\uBA78\uB418\uACE0 \uC0AC\uD68C\uC548\uC815\uC774 \uAE30\uB300\uB428\uC5D0 \uB530\uB77C \uC885\uD569\uC8FC\uAC00\uC9C0\uC218\uAC00 \uC0C1\uC2B9\uD558\uB294 \uC774 \uD604\uC0C1\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
65=\uBB38\uC81C : \uB2F9\uC7A5 \uB0BC \uB3C8\uC774 \uC5C6\uB294 \uC751\uAE09\uD658\uC790 \uC758\uB8CC\uBE44\uB97C \uAD6D\uAC00\uAC00 \uB300\uC2E0 \uB0B4\uC8FC\uACE0 \uB098\uC911\uC5D0 \uAD6D\uAC00\uC5D0\uAC8C \uC0C1\uD658\uD558\uB294 \uC774 \uC81C\uB3C4\uC758 \uC774\uB984\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
66=\uBB38\uC81C : \uC2A4\uD3EC\uCE20 \uC885\uBAA9 \uC911 '\uB9C8\uB77C\uD1A4'\uC744 \uAE08\uC9C0\uD558\uB294 \uD398\uB974\uC2DC\uC544\uC758 \uD6C4\uC608\uC778 \uC774 \uB098\uB77C\uB294 \uC5B4\uB514\uC77C\uAE4C\uC694? \n
67=\uBB38\uC81C : \uBE48\uBAA8\uAC15\uC5D0 \uC18D\uD558\uB294 \uD658\uD615\uB3D9\uBB3C\uC758 \uCD1D\uCE6D\uC73C\uB85C \uCCA0\uD559\uC790 \uC544\uB9AC\uC2A4\uD1A0\uD154\uB808\uC2A4\uB294 \uC774\uAC83\uC744 '\uC9C0\uAD6C\uC758 \uCC3D\uC790'\uB77C\uACE0 \uD588\uC2B5\uB2C8\uB2E4 \uC774\uAC83\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
68=\uBB38\uC81C : \uAE08\uC735\uC2DC\uC7A5\uC774 \uBD88\uC548\uC815\uD558\uAC70\uB098 \uBD80\uC2E4\uD55C \uC740\uD589\uC5D0 \uBD88\uC548\uAC10\uC744 \uB290\uAEF4\uC11C \uACE0\uAC1D\uC774 \uD55C\uAEBC\uBC88\uC5D0 \uB3C8\uC744 \uCC3E\uC544\uAC00\uB294 \uB300\uADDC\uBAA8 \uC608\uAE08\uC778\uCD9C\uC0AC\uD0DC\uC778 \uC774 \uC6A9\uC5B4\uB294?\n
69=\uBB38\uC81C : \uC2E0\uCD95 \uAC74\uBB3C\uC548\uC5D0\uC11C \uAC70\uC8FC\uC790\uB4E4\uC774 \uB290\uB07C\uB294 \uAC74\uAC15\uC0C1 \uBB38\uC81C \uBC0F \uBD88\uCF8C\uAC10\uC744 \uC774\uB974\uB294 \uC774 \uC6A9\uC5B4\uB294 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
70=\uBB38\uC81C : \uC138\uC0C1\uC5D0\uC11C \uAC00\uC7A5 \uC798 \uAE68\uC9C0\uB294 \uCC3D\uBB38\uC758 \uC774\uB984\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694? (\uB10C\uC13C\uC2A4)\n
71=\uBB38\uC81C : \uAC70\uB798 \uB2E8\uACC4\uBCC4\uB85C \uC7AC\uD654\uB098 \uC6A9\uC5ED\uC5D0 \uC0C8\uB85C \uBD80\uAC00\uB418\uB294 \uAC00\uCE58\uC5D0 \uBD80\uACFC\uB418\uB294 \uC870\uC138\uC778 \uC774\uAC83\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
72=\uBB38\uC81C : \uB208 \uC55E\uC5D0 \uBA3C\uC9C0\uB098 \uBC8C\uB808\uAC19\uC740 \uBB34\uC5B8\uAC00\uAC00 \uB5A0\uB2E4\uB2C8\uB294 \uAC83\uCC98\uB7FC \uB290\uB07C\uB294 \uC99D\uC0C1\uC774\uBA70, \uC2DC\uC120\uC704\uCE58\uC5D0 \uB530\uB77C \uB530\uB77C\uB2E4\uB2C8\uAE30\uB3C4 \uD558\uB294 \uC774 \uC99D\uC0C1\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
73=\uBB38\uC81C : \uC774\uC2A4\uB77C\uC5D8 IMI\uC0AC\uC5D0\uC11C \uAC1C\uBC1C\uD55C \uCD08\uB300\uD615 \uAD8C\uCD1D\uC774\uBA70, \uB300\uAD6C\uACBD \uD0C4\uC744 \uC0AC\uC6A9\uD558\uC5EC \uAC00\uC7A5 \uAC15\uB825\uD55C \uC790\uB3D9\uAD8C\uCD1D\uC774\uAE30\uB3C4 \uD55C \uC774 \uAD8C\uCD1D\uC758 \uC774\uB984\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694? \n
74=\uBB38\uC81C : 1987\uB144 \uC774\uC2A4\uB77C\uC5D8\uC5D0 \uC800\uD56D\uD558\uB294 \uD314\uB808\uC2A4\uD0C0\uC778\uC758 \uBB34\uC7A5\uB2E8\uCCB4\uC774\uBA70, 2006\uB144 \uC790\uCE58\uC815\uBD80\uC758 \uC9D1\uAD8C\uB2F9\uC774 \uB41C \uC774 \uB2E8\uCCB4\uC758 \uC774\uB984\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
75=\uBB38\uC81C : 2001\uB144~2010\uB144 \uC138\uACC4 \uC554\uC13C\uD130 \uAE30\uC900. (\uD3D0\uC554/\uC704\uC554/\uAC04\uC554/\uAC11\uC0C1\uC120\uC554/\uB300\uC7A5\uC554) 5\uAC00\uC9C0\uC758 \uC554 \uC911\uC5D0 \uC0DD\uC874\uB960\uC774 \uAC00\uC7A5 \uB0AE\uC740 \uC554\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
76=\uBB38\uC81C : \uC2DC\uAC01\uACFC \uCCAD\uAC01\uC744 \uC783\uC740 \uC704\uC778 '\uD5EC\uB80C \uCF08\uB7EC'\uC5D0\uAC8C \uD070 \uC601\uD5A5\uC744 \uC900 \uAD50\uC721\uAC00\uC778 \uC774 \uC120\uC0DD\uB2D8\uC758 \uC774\uB984\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
77=\uBB38\uC81C : \uC8FC\uC704\uC5D0 \uC0AC\uB78C\uB4E4\uC774 \uB9CE\uC744 \uC218 \uB85D \uC5B4\uB824\uC6C0\uC5D0 \uCC98\uD55C \uC0AC\uB78C\uC744 \uB3D5\uC9C0 \uC54A\uAC8C \uB418\uB294 \uD604\uC0C1\uC744 \uB73B\uD558\uB294 \uC774 \uC2EC\uB9AC\uD559 \uC6A9\uC5B4\uB294 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
78=\uBB38\uC81C : \uC804\uC124\uC5D0 \uB098\uC624\uB294 \uC2E0\uB839\uC2A4\uB7EC\uC6B4 \uC0C8\uC774\uBA70 \uC8FD\uC74C\uACFC \uBD80\uD65C\uC744 \uBC18\uBCF5\uD558\uC5EC \uBD88\uC0AC\uC870\uB77C\uACE0\uB3C4 \uBD88\uB9AC\uB294 \uC774\uAC83\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
79=\uBB38\uC81C : \uCCAD\uC18C\uB144\uC774 \uC790\uC5F0\uACFC \uCE5C\uC219\uD574\uC9C0\uACE0 \uAC74\uC804\uD55C \uC57C\uC678\uD65C\uB3D9\uC744 \uAC16\uAE30 \uC704\uD574 \uBE44\uC601\uB9AC\uC801\uC778 \uC219\uBC15\uC744 \uAC16\uCD98 \uC774 \uC2DC\uC124\uC758 \uC774\uB984\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
80=\uBB38\uC81C : \uB3D9\uD654 '\uC548\uB124\uC758 \uC77C\uAE30'\uC5D0\uC11C \uC548\uB124\uAC00 \uC4F0\uB358 \uCC45\uC0C1\uC758 \uC774\uB984\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?(\uB10C\uC13C\uC2A4)\n
81=\uBB38\uC81C : \uCD95\uAD6C \uACBD\uAE30\uC5D0\uC11C \uACF5\uACA9\uD300 \uC120\uC218\uAC00 \uC0C1\uB300\uD3B8 \uC9C4\uC601\uC5D0\uC11C \uACF5\uBCF4\uB2E4 \uC55E\uCABD\uC5D0 \uC788\uC744 \uB54C \uC801\uC6A9\uB418\uB294 \uBC18\uCE59\uC778 \uC774\uAC83\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
82=\uBB38\uC81C : \uB3FC\uC9C0\uC758 '\uB4F1\uACB9\uC0B4'\uC774\uBA70 \uBAA9\uC2EC\uACFC \uB4F1\uC2EC\uC758 \uC5F0\uACB0\uBD80\uC704\uC5D0 \uC788\uB294 \uC0AC\uB78C \uC190\uBC14\uB2E5\uB9CC\uD55C \uC624\uAC01\uD615 \uBAA8\uC591\uC758 \uC0B4\uCF54\uAE30\uC778 \uC774 \uBD80\uC704\uB294?\n
83=\uBB38\uC81C : \uC774\uD0C8\uB9AC\uC544 \uBCA0\uB124\uCE58\uC544 \uC2DC\uB0B4\uC5D0 \uC788\uB294 \uC6B4\uD558\uB97C \uC6B4\uD56D\uD558\uB294 \uBC30\uB85C, \uC774\uD0C8\uB9AC\uC544 \uB9D0\uB85C '\uD754\uB4E4\uB9AC\uB2E4'\uB77C\uB294 \uB73B\uC758 \uC774\uAC83\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
84=\uBB38\uC81C : \uAD50\uB958\uD68C\uB85C\uC5D0\uC11C \uC778\uAC00 \uC804\uC555 \uBC0F \uD68C\uB85C\uC5D0 \uD750\uB974\uB294 \uC804\uB958\uC758 \uBE44\uC728\uC744 \uC758\uBBF8\uD558\uBA70 \uD68C\uB85C \uC804\uB958\uAC00 \uD750\uB974\uAE30 \uC5B4\uB824\uC6B4 \uC815\uB3C4\uB97C \uB098\uD0C0\uB0B4\uB294 \uC774 \uC6A9\uC5B4\uB294?\n
85=\uBB38\uC81C : \uAD6C\uC18C\uB828\uC5D0 \uC758\uD558\uC5EC \uAC1C\uBC1C\uB41C \uC804\uC220\uC6A9 \uD575\uBBF8\uC0AC\uC77C\uB85C \uAC78\uD504\uC804 \uB54C \uC8FC\uB85C \uC0AC\uC6A9\uB418\uAE30\uB3C4 \uD55C \uD0C4\uB3C4\uBBF8\uC0AC\uC77C\uC778 \uC774\uAC83\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
86=\uBB38\uC81C : 1997\uB144 12\uC6D4\uC5D0 \uCCB4\uACB0 \uB41C \uC9C0\uAD6C\uC628\uB09C\uD654 \uC628\uC2E4\uAC00\uC2A4 \uAC10\uCD95\uBAA9\uD45C\uC758 \uAD00\uD55C \uAE30\uD6C4\uBCC0\uD654 \uD611\uC57D\uC11C\uC778 \uC774\uAC83\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
87=\uBB38\uC81C : \uC81C\uC8FC\uB3C4\uC5D0 \uB9CE\uC774 \uBD84\uD3EC\uD55C \uC2DD\uBB3C\uB85C, \uC2DD\uBB3C \uC804\uCCB4\uC5D0 \uB3C5\uC744 \uB0B4\uD3EC\uD558\uACE0 \uC788\uC73C\uBA70 \uAF43\uB9D0\uC740 '\uC704\uD5D8'\uC778 \uC774 \uC2DD\uBB3C\uC758 \uC774\uB984\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
88=\uBB38\uC81C : \uB808\uC624\uB098\uB974\uB3C4 \uB2E4\uBE48\uCE58\uAC00 \uADF8\uB9B0 '\uCD5C\uD6C4\uC758 \uB9CC\uCC2C'\uC5D0\uC11C \uC608\uC218\uB97C \uD3EC\uD568\uD558\uC5EC \uB098\uC624\uB294 \uC778\uBB3C\uC740 \uCD1D \uBA87\uBA85\uC77C\uAE4C\uC694?\n
89=\uBB38\uC81C : \uC190\uC624\uACF5\uC774 \uD654\uACFC\uC0B0 \uC218\uB834\uB3D9\uC5D0 \uC788\uC744 \uB54C \uC758\uD615\uC81C\uB97C \uB9FA\uC5C8\uB358 \uC694\uAD34\uB85C, \uD63C\uCCA0\uACE4\uC774\uB77C\uB294 \uBB34\uAE30\uB97C \uC0AC\uC6A9\uD558\uB294 \uC774 \uC778\uBB3C\uC740 \uB204\uAD6C\uC77C\uAE4C\uC694?\n
90=\uBB38\uC81C : \uD615\uC744 \uB9E4\uC6B0 \uC88B\uC544\uD558\uB294 '\uB3D9\uC0DD'\uC744 \uBB34\uC5C7\uC774\uB77C\uACE0 \uD560\uAE4C\uC694?(\uB10C\uC13C\uC2A4)\n
91=\uBB38\uC81C : \uC544\uC2DC\uC544 \uC11C\uB0A8\uBD80\uC5D0 \uC788\uB294 \uACF5\uD654\uAD6D\uC778 '\uC774\uC2A4\uB77C\uC5D8'\uC758 \uC218\uB3C4\uB294 \uC5B4\uB514\uC77C\uAE4C\uC694?\n
92=\uBB38\uC81C : \uC790\uB294 \uC6D0\uC591. \uC870\uC870\uC758 \uB9F9\uC7A5\uC774\uBA70, \uC77C\uCC0D\uBD80\uD130 \uC870\uC870\uB97C \uB3C4\uC640 \uB9CE\uC740 \uACF5\uC744 \uC138\uC6E0\uACE0, \uB208\uC5D0 \uD654\uC0B4\uC744 \uB9DE\uC558\uC5C8\uB358 \uC774 \uC778\uBB3C\uC740 \uB204\uAD6C\uC77C\uAE4C\uC694?\n
93=\uBB38\uC81C : \uC77C\uBCF8 \uD6D7\uCE74\uC774\uB3C4\uC758 \uB3C4\uCCAD\uC18C\uC7AC\uC9C0\uC774\uBA70, \uC544\uC774\uB204\uC871\uC758 \uB9D0\uC5D0\uC11C \uC720\uB798\uB41C \uB9E5\uC8FC\uC640 \uB77C\uBA74\uC774 \uC720\uBA85\uD55C \uC774 \uB3C4\uC2DC\uB294 \uC5B4\uB514\uC77C\uAE4C\uC694? \n
94=\uBB38\uC81C : \uACE0\uB824 \uCDA9\uB82C\uC655 \uB54C \uCD94\uC801\uC774 \uD3B8\uCC2C\uD558\uC600\uC73C\uBA70, \uC911\uAD6D \uACE0\uC804\uC758 \uAE08\uC5B8, \uBA85\uAD6C\uB97C \uD3B8\uC9D1\uD574\uC11C \uB9CC\uB4E0 \uC5B4\uB9B0\uC774\uB97C \uC704\uD55C \uD559\uC2B5\uCC45\uC778 \uC774\uAC83\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
95=\uBB38\uC81C : \uBC8C\uC744 \uBC1B\uC744 \uB54C \uC791\uC131\uD558\uB294 '\uBC18\uC131\uBB38'\uC744 \uC601\uC5B4\uB85C \uBC88\uC5ED\uD558\uBA74?(\uB10C\uC13C\uC2A4)\n
96=\uBB38\uC81C : \uC77C\uBCF8\uC5B4\uC778 '\uBD80\uD0C0(\u8C5A)'\uB97C \uD55C\uAD6D\uC5B4\uB85C \uBC88\uC5ED\uD558\uBA74 \uBB34\uC2A8 \uB9D0 \uC77C\uAE4C\uC694?\n
97=\uBB38\uC81C : \uB2E8\uAD70\uC2E0\uD654\uC5D0\uC11C '\uAD6C\uB984'\uC744 \uAD00\uC7A5\uD558\uB294 \uC8FC\uC220\uC0AC(\uC2E0)\uB85C \uC54C\uB824\uC9C4 \uC774 \uC778\uBB3C\uC740 \uB204\uAD6C\uC77C\uAE4C\uC694?\n
98=\uBB38\uC81C : \uC870\uC120 \uC911\uAE30 \uC784\uC9C4\uC65C\uB780 \uB54C \uC758\uBCD1\uC7A5\uC73C\uB85C \uC8FC\uB85C \uB9D0\uC744 \uD0C0\uACE0 \uC65C\uC801\uC744 \uBB34\uCC14\uB800\uC73C\uBA70, \uD64D\uC758\uC7A5\uAD70\uC774\uB77C\uACE0\uB3C4 \uBD88\uB9B0 \uC774 \uC778\uBB3C\uC740 \uB204\uAD6C\uC77C\uAE4C\uC694?\n
99=\uBB38\uC81C : \uC2E0\uB77C \uBB38\uBB34\uC655 14\uB144\uC5D0 \uCD95\uC870\uB41C \uC2E0\uB77C\uC758 \uAD81\uC6D0\uC9C0\uC774\uBA70 \uD604\uC7AC \uACBD\uBD81 \uACBD\uC8FC\uC2DC \uC778\uAD50\uB3D9\uC5D0 \uC788\uB294 \uC5F0\uBABB\uC778 \uC774\uACF3\uC740 \uC5B4\uB514\uC77C\uAE4C\uC694?\n
100=\uBB38\uC81C : 2011\uB144 \uD55C\uAD6D\uAD00\uACF5\uC0AC \uD1B5\uACC4\uAE30\uC900\uC73C\uB85C \uD55C\uAD6D\uC778\uB4E4\uC774 \uAC00\uC7A5 \uB9CE\uC774 \uB5A0\uB09C \uD574\uC678 \uC5EC\uD589\uC9C0\uB294 \uC5B4\uB290 \uB098\uB77C\uC77C\uAE4C\uC694?\n
101=\uBB38\uC81C : \uCD08\uACE0\uC628\uC5D0\uC11C \uC74C\uC804\uD558\uB97C \uAC00\uC9C4 \uC804\uC790\uC640 \uC591\uC804\uD558\uB97C \uB764 \uC774\uC628\uC73C\uB85C \uBD84\uB9AC\uB41C \uAE30\uCCB4 \uC0C1\uD0DC\uB97C \uB9D0\uD558\uB294 \uC774 \uC6A9\uC5B4\uB294 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
102=\uBB38\uC81C : \uC791\uC740 \uBCC0\uD654\uAC00 \uD3ED\uD48D\uC6B0\uC640 \uAC19\uC740 \uCEE4\uB2E4\uB780 \uBCC0\uD654\uB85C \uC720\uBC1C\uC2DC\uD0A4\uB294 \uD604\uC0C1\uC744 \uB9D0\uD558\uB294 \uC774 \uC6A9\uC5B4\uB294 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
103=\uBB38\uC81C : \uD654\uD1B5\uC774 \uBD99\uC740 \uB0C4\uBE44\uC5D0 \uC5EC\uB7EC\uAC00\uC9C0 \uC5B4\uC721\uACFC \uCC44\uC18C\uB97C \uB123\uACE0 \uC721\uC218\uB97C \uBD93\uACE0 \uB053\uC774\uBA74\uC11C \uBA39\uB294 \uC804\uD1B5 \uAD81\uC911\uC694\uB9AC\uC778 \uC774\uAC83\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
104=\uBB38\uC81C : \uC6B0\uB9AC\uB098\uB77C\uC758 \uC720\uD559\uC790 '\uD1F4\uACC4 \uC774\uD669'\uC774 \uC138\uC0C1\uC744 \uB5A0\uB09C \uD6C4 \uADF8\uC758 \uC81C\uC790\uB4E4\uC5D0 \uC758\uD558\uC5EC \uAC74\uB9BD\uB41C \uAC74\uCD95\uC758 \uC774\uB984\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
105=\uBB38\uC81C : \uADF8\uB9AC\uC2A4\uB85C\uB9C8\uC2E0\uD654 \uC911 \uB2E4\uC774\uB2EC\uB85C\uC2A4\uC758 \uC544\uB4E4\uC774\uBA70, \uC5B4\uB9AC\uC11D\uC74C\uACFC \uACFC\uC695\uC744 \uC0C1\uC9D5\uD558\uB294 \uC778\uBB3C\uB85C, \uBC14\uB2E4\uC5D0 \uCD94\uB77D\uD558\uC5EC \uC0AC\uB9DD\uD55C \uC774 \uC778\uBB3C\uC740 \uB204\uAD6C\uC77C\uAE4C\uC694?\n
106=\uBB38\uC81C : \uC81C2\uCC28 \uACE0\uAD6C\uB824\uC640 \uBD80\uC5EC\uC804\uC7C1\uC774 \uBC8C\uC5B4\uC9C4 22\uB144(\uB300\uBB34\uC2E0\uC655)\uB54C \uBD80\uC5EC\uC655 \uB300\uC18C\uB97C \uC0B4\uD574\uD55C \uACE0\uAD6C\uB824\uC758 \uC7A5\uC218\uC778 \uC774 \uC778\uBB3C\uC740 \uB204\uAD6C\uC77C\uAE4C\uC694?\n
107=\uBB38\uC81C : \uC9C0\uD558\uCCA0\uC5D0\uC11C \uD55C \uC88C\uC11D \uC5F4(\uAE38\uAC8C \uBED7\uC740 \uC758\uC790)\uC5D0\uC11C \uC549\uC744 \uC218 \uC788\uB294 \uCD5C\uB300 \uC815\uC6D0\uC740 \uBA87\uBA85\uC77C\uAE4C\uC694?\n
108=\uBB38\uC81C : \uC22B\uC790 ' 1, 2, 3, 4, 5, 6, 7, 8 ' \uC744 \uB124\uAE00\uC790\uB85C \uC904\uC774\uBA74 \uBB34\uC5C7\uC77C\uAE4C\uC694?(\uB10C\uC13C\uC2A4)\n
109=\uBB38\uC81C : 2013\uB144 \uC11C\uC6B8 \uC131\uD615\uC678\uACFC 100\uACF3 \uD1B5\uACC4\uC870\uC0AC \uAE30\uC900\uC73C\uB85C '20\uB300 \uC5EC\uC131\uB4E4\uC774 \uAC00\uC7A5 \uB9CE\uC774 \uD55C \uC131\uD615 \uC2DC\uC220\uC740?\n
110=\uBB38\uC81C : \uC6F9\uC5D0\uC11C \uCD5C\uC0C1\uC758 \uBE44\uD2B8\uB9F5 \uC774\uBBF8\uC9C0\uB97C \uAD6C\uD604\uD558\uAE30 \uC704\uD574 W3C\uC5D0\uC11C \uC81C\uC815\uD55C \uD30C\uC77C \uD3EC\uB9F7\uC73C\uB85C, GIF\uC758 \uB300\uC548\uC778 \uC774 \uD655\uC7A5\uC790\uB294 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
111=\uBB38\uC81C : \uC601\uD654 '\uCE5C\uAD6C'\uB294 \uBD80\uC0B0\uC9C0\uC5ED\uC758 \uC720\uBA85 \uC870\uC9C1\uD3ED\uB825 \uB2E8\uCCB4\uB97C \uBAA8\uD2F0\uBE0C \uD55C \uC601\uD654\uC785\uB2C8\uB2E4 \uC774 \uC870\uC9C1\uC758 \uC774\uB984\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
112=\uBB38\uC81C : 2001\uB144 \uC138\uACC4 \uCD5C\uCD08\uB85C \uC548\uB77D\uC0AC\uB97C \uD569\uBC95\uD654\uD55C \uB098\uB77C\uB294 \uC5B4\uB514\uC77C\uAE4C\uC694?\n
113=\uBB38\uC81C : \uB3C4\uC2DC\uC640 \uC790\uC5F0 \uD658\uACBD\uC18D\uC5D0 \uC874\uC7AC\uD558\uB294 \uB2E4\uC591\uD55C \uC7A5\uC560\uBB3C\uB4E4\uC744 \uD65C\uC6A9\uD558\uC5EC \uC774\uB3D9\uD558\uB294 \uAC1C\uC778 \uD6C8\uB828\uC778 \uC774\uAC83\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
114=\uBB38\uC81C : \uC601\uAD6D, \uB124\uB35C\uB780\uB4DC, \uD504\uB791\uC2A4\uAC00 \uB3D9\uC591 \uBB34\uC5ED\uC744 \uC6A9\uC774\uD558\uAC8C \uD558\uAE30 \uC704\uD574 \uC124\uB9BD\uD55C \uC774 \uD68C\uC0AC\uC758 \uC774\uB984\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
115=\uBB38\uC81C : \uB3C5\uB3C4 \uD574\uC5ED\uC5D0 \uB9E4\uC7A5 \uB41C \uC790\uC6D0\uC774\uBA70, \uBA54\uD0C4\uC774 \uC8FC\uC131\uBD84\uC778 \uAC00\uC2A4\uAC00 \uC5BC\uC74C\uCC98\uB7FC \uACE0\uCCB4\uD654\uB41C \uC5D0\uB108\uC9C0\uC778 \uC774 \uC790\uC6D0\uC758 \uC774\uB984\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
116=\uBB38\uC81C : \uB7F0\uB358 \uB0A8\uC11C\uCABD\uC5D0 \uC790\uB9AC\uD558\uBA70 \uB3C5\uD2B9\uD55C \uC120\uC0AC\uC2DC\uB300\uC758 \uAC70\uC11D\uBB38\uD654\uB97C \uC5FF\uBCFC \uC218 \uC788\uB294 \uACF3\uC73C\uB85C \uC720\uBA85\uD55C \uC774 \uC720\uC801\uC9C0\uC758 \uC774\uB984\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
117=\uBB38\uC81C : \uC544\uB974\uD5E8\uD2F0\uB098 \uCD9C\uC0DD\uC758 \uCFE0\uBC14 \uC815\uCE58\uD601\uBA85\uAC00\uC774\uBA70 \uCFE0\uBC14\uD601\uBA85\uC5D0 \uAC00\uB2F4\uD558\uC600\uACE0, \uBBFC\uC911 \uD601\uBA85\uC744 \uC704\uD574 \uC2F8\uC6B0\uB2E4 \uC0AC\uB9DD\uD55C \uC774 \uC778\uBB3C\uC740 \uB204\uAD6C\uC77C\uAE4C\uC694?\n
118=\uBB38\uC81C : \uC5D0\uB3C4\uC2DC\uB300\uC758 \uC77C\uBCF8 \uBB34\uC7A5 \uC815\uCE58\uAC00\uC774\uBA70 \uD788\uB370\uC694\uC2DC \uC0AC\uB9DD \uC774\uD6C4 \uC138\uD0A4\uAC00\uD558\uB77C \uC804\uD22C\uC5D0\uC11C \uB3D9\uAD70\uC744 \uC9C0\uD718\uD55C \uC774 \uC778\uBB3C\uC740 \uB204\uAD6C\uC77C\uAE4C\uC694?\n
119=\uBB38\uC81C : 17\uC138\uAE30 \uC870\uC120 \uC219\uC885 \uB54C\uC758 \uBB38\uC2E0\uC774\uC790 \uC18C\uC124\uAC00\uC778 \uC11C\uD3EC '\uAE40\uB9CC\uC911'\uC774 \uC4F4 \uC720\uBA85\uD55C \uD55C\uAE00 \uC18C\uC124\uC778 \uC774\uAC83\uC740 \uBB34\uC5C7\uC77C\uAE4C\uC694?\n
120=\uBB38\uC81C : KOSTA \uCD5C\uACE0\uC758 \uC5BC\uC9F1\uC740?